#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-079792477e2f8277e]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0a30d9bd46572e12b"]: Reading...
data.aws_subnet.subnet["subnet-0f649123fa019ba28"]: Reading...
data.aws_subnet.subnet["subnet-0a30970939f664e5f"]: Reading...
data.aws_subnet.subnet["subnet-0845fd9c70e5233b2"]: Reading...
data.aws_subnet.subnet["subnet-046590e8dc96f93c6"]: Reading...
data.aws_subnet.subnet["subnet-0a24bd7f26628f58a"]: Reading...
data.aws_subnet.subnet["subnet-0a30970939f664e5f"]: Read complete after 0s [id=subnet-0a30970939f664e5f]
data.aws_subnet.subnet["subnet-0a30d9bd46572e12b"]: Read complete after 0s [id=subnet-0a30d9bd46572e12b]
data.aws_subnet.subnet["subnet-0845fd9c70e5233b2"]: Read complete after 0s [id=subnet-0845fd9c70e5233b2]
data.aws_subnet.subnet["subnet-0a24bd7f26628f58a"]: Read complete after 0s [id=subnet-0a24bd7f26628f58a]
data.aws_subnet.subnet["subnet-046590e8dc96f93c6"]: Read complete after 0s [id=subnet-046590e8dc96f93c6]
data.aws_subnet.subnet["subnet-0f649123fa019ba28"]: Read complete after 0s [id=subnet-0f649123fa019ba28]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "MechTechApi"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "fiap",
          + "live",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam:::AWS_ACCOUNT_ID:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "MechTechApi"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam:::AWS_ACCOUNT_ID:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "MechTechApi"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::999789506794:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-046590e8dc96f93c6",
              + "subnet-0845fd9c70e5233b2",
              + "subnet-0a30970939f664e5f",
              + "subnet-0a30d9bd46572e12b",
              + "subnet-0f649123fa019ba28",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "MechTechApi"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "NG-MechTechApi"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::999789506794:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-046590e8dc96f93c6",
          + "subnet-0845fd9c70e5233b2",
          + "subnet-0a30970939f664e5f",
          + "subnet-0a30d9bd46572e12b",
          + "subnet-0f649123fa019ba28",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Este grupo e usado na live de terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "SG-MechTechApi"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-079792477e2f8277e"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name = "MechTechApi"
  + region       = "us-east-1"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ervinnotari, Action: `pull_request`*